Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
f1= pd.Series([4,8,15,16,23,42])

In [3]:
f1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [8]:
list = [1,3,2,4,6,5,7,8,9,11]
f2= pd.Series(list)

In [9]:
f2

0     1
1     3
2     2
3     4
4     6
5     5
6     7
7     8
8     9
9    11
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Name
Alice
Bob
Claire

Age
25
30
27

Gender
Female
Male
Female

Then, print the DataFrame.

In [17]:
dic = {'Name' :['Alice','Bob','Clare'],
       'Age':[25,30,27],
       'Gender':['Female','Male','Female']}
f3=pd.DataFrame(dic)

In [19]:
f3

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clare   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different type.
series are 1d array while dataframe are 2d array .

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

we can use head ,tail ,index and many other functions on it for example:

In [25]:
dic = {'Name' :['Alice','Bob','Clare','Rose'],
       'Age':[25,30,27,20],
       'Gender':['Female','Male','Female','Female']}
f3=pd.DataFrame(dic)

In [26]:
f3

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male
2  Clare   27  Female
3   Rose   20  Female

In [29]:
f3.tail(2)

    Name  Age  Gender
2  Clare   27  Female
3   Rose   20  Female

In [32]:
f3.head(2)

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All are mutable in naturebut in different ways like dataframe is both sze and value mutable while series is only value mutable we can not change the size of the series.and panale is same as dataframe.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [8]:
import pandas as pd

f1=pd.Series(['Piyush','Shivi','Sandy'])
f2=pd.Series([20,21,19])
f3=pd.Series(['Male','Female','Male'])
df=pd.DataFrame([f1,f2,f3])

In [9]:
df

        0       1      2
0  Piyush   Shivi  Sandy
1      20      21     19
2    Male  Female   Male